trunk/src/QuanLyTruongLopComApp/test/TaoLop/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:quan="QuanLyTruongLopComApp">
  <soapenv:Body>
    <quan:TaoLopOperation>
      <tenlop>9a2</tenlop>
      <id_khoilop>1</id_khoilop>
      <id_namhoc>1</id_namhoc>
    </quan:TaoLopOperation>
  </soapenv:Body>
</soapenv:Envelope>